Repository: Mohammedzxz712/charity
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

# forget
source: Forget password
ar: نسيت كلمة المرور

source: Create Account
ar: إنشاء حساب

source: Update
ar: تحديث

source: Phone Must Be Required
ar: يجب ادخال رقم الهاتف

source: Phone
ar: الهاتف

source: Location Must Be Required
ar: يجب ادخال الموقع

source: Name Must Be Required
ar: يجب ادخال الاسم

source: Location
ar: الموقع

source: Name
ar: الاسم

source: Operation successful
ar: عملية ناجحة

# pleaseenterquantity
source: Please enter the quantity
ar: من فضلك أدخل الكمية

# pleaseenterfoodtype
source: Please enter the food type
ar: من فضلك أدخل نوع الطعام

# pleaseentervalidnumber
source: Please enter a valid number
ar: من فضلك أدخل عدد صحيح

# pleaseenternumberofclothingitems
source: Please enter the number of clothing items
ar: من فضلك أدخل عدد قطع الملابس

# pleaseenterdetails
source: Please enter the details
ar: من فضلك أدخل التفاصيل

# blooddonationsuccess
source: Blood donation details submitted successfully.
ar: تم تقديم تفاصيل التبرع بالدم بنجاح.

source: Please enter any diseases
ar: من فضلك ادخل اي مرض

source: Please select an option
ar: من فضلك ادخل اي اختيار

# haveyoudonatedbloodbeforethreemonths
source: Have you donated blood in the last three months?
ar: هل قمت بالتبرع بالدم قبل 3 شهور

source: Edit Profile
ar: تعديل الملف الشخصي

source: SEND
ar: إرسال

source: Do you have any diseases?
ar: هل لديك اي امراض

source: Blood type
ar: نوع الفصيله

source: Blood donation details
ar: تفاصيل التبرع بالدم

source: Type
ar: النوع

source: Please enter a valid number
ar: من فضلك أدخل عدد صحيح

source: Number of clothing items
ar: عدد قطع الملابس

source: Details
ar: التفاصيل

source: Clothing donation details
ar: تفاصيل التبرع بالملابس

# clothingdonationsuccess
source: Clothing donation details submitted successfully.
ar: تم تقديم تفاصيل التبرع بالملابس بنجاح.

source: OK
ar: موافق

source: Upload image
ar: رفع صوره

source: Quantity
ar: الكمية

source: Food type
ar: نوع الطعام

source: Food donation details
ar: تفاصيل التبرع بالطعام

source: Alright
ar: حسناً

# fooddonationerror
source: An error occurred while submitting food donation details.
ar: حدث خطأ أثناء تقديم تفاصيل التبرع بالطعام.

source: Operation failed
ar: عملية فاشلة

# fooddonationsuccess
source: Food donation details submitted successfully.
ar: تم تقديم تفاصيل التبرع بالطعام بنجاح.

source: cha
ar: للخ

source: rity
ar: ير

source: log
ar: تسجيل

# ins
source: in
ar: دخول

source: Sign Up
ar: تسجيل

source: Otp
ar: رمز التحقق

source: Full Name
ar: الاسم الكامل

source: Payment
ar: الدفع

source: Enter Payment Details
ar: ادخل تفاصيل الدفع

source: Money Donation Details
ar: تفاصيل التبرع المالي

source: Amount
ar: الكميه

source: Categories
ar: نوع التبرع

source: Please enter the payment amount
ar: من فضلك ادخل كمية الدفع

source: Payment Failed
ar: فشل الدفع

source: Payment Successful
ar: نجح الدفع

source: Confirm Password
ar: تأكيد كلمة المرور

source: Already have account?
ar: هل لديك حساب؟

# continues
source: Continue
ar: استمر

# passwordmustinclude
source: Password must include: 0-9, A-Z, a-z, and special characters
ar: كلمة المرور يجب ان تحتوي علي رموز خاصه وحروف كبيره وصغيره وارقام

source: Should Enter Password
ar: يجب ادخال كلمة المرور

# emailmustcontain
source: Email Must Contain @ com
ar: يجب ان يحتوي البريد علي @ com

source: Should Enter Email
ar: يجب ادخال البريد الالكتروني

source: Email Or Password Incorrect
ar: البريد الالكتروني او كلمة المرور خطاء

source: Forget Successfully
ar: تم بنجاح

source: Login Successfully
ar: نجح تسجيل الدخول

source: signup successfully
ar: نجح التسجيل

source: Make Review
ar: اجراء مراجعه

source: Contacts
ar: جهات الاتصال

# emailshouldcontainatandcom
source: Email should contain @ and .com
ar: يجب أن يحتوي البريد الإلكتروني على @ و .com

source: Please enter your review
ar: يرجى إدخال تقييمك

source: Write your review........
ar: اكتب تقييمك........

source: Should enter username
ar: يجب إدخال اسم المستخدم

source: Password does not match
ar: كلمة المرور غير متطابقة

source: We are a passionate and dedicated team working relentlessly to make a positive impact in the world. Our mission is to uplift communities, provide essential resources, and promote equality for all. Together we can create positive change by supporting those in need
ar: نحن فريق شغوف ومتفاني يعمل بلا كلل لإحداث تأثير إيجابي في العالم. مهمتنا هي رفع المجتمعات، وتوفير الموارد الأساسية، وتعزيز المساواة للجميع. معًا يمكننا إحداث تغيير إيجابي من خلال دعم المحتاجين

source: Our Charity
ar: جمعيتنا الخيرية

source: Welcome to
ar: مرحبا بك في

source: Please enter a location
ar: الرجاء إدخال موقع

source: Please enter a phone number
ar: الرجاء إدخال رقم الهاتف

# sign1
source: sign
ar: تسج

# up1
source: up
ar: يل

source: try again
ar: حاول مره اخري

source: reset
ar: إعادة تعيين

# reset1
source: reset
ar: تعيين

source: should enter otp
ar: يجب ادخال رمز التحقق

source: Login
ar: تسجيل الدخول

source: HELP OUR INSTITUTIONS
ar: ساعد مؤسساتنا

source: Lorem ipsum dolor sit amet, consetetur sadipscing elitr Lorem ipsum dolor sit amet, consetetur sadipscing elitr
ar: لوريم إيبسوم دولار سيت أميت، كونستيتور ساديبسينغ إيليت. لوريم إيبسوم دولار سيت أميت، كونستيتور ساديبسينغ إيليت

source: LEARN MORE
ar: اعرف المزيد

source: HOME
ar: الصفحة الرئيسية

source: ABOUT
ar: حول

source: SUPPORT
ar: الدعم

source: SIGN OUT
ar: تسجيل الخروج

source: DONATE NOW
ar: تبرع الآن

# food
source: FOOD DONATION DEATAILS
ar: تفاصيل التبرع بالطعام

# typefood
source: Type of food
ar: نوع الطعام

source: Expiration Date
ar: تاريخ الانتهاء

# money
source: Money Donation Details
ar: تفاصيل التبرع بالمال

# typemoney
source: Type of Money
ar: نوع المال

source: Submit
ar: إرسال

source: Reviews
ar: المراجعات
